---
kind: type
id: T:Autodesk.Revit.DB.SolidGeometry
source: html/5d324ccb-04a0-0044-dc7d-1e144163082d.htm
---
# Autodesk.Revit.DB.SolidGeometry

An enumerated type listing possible ways of exporting solids in 3D views.

## Syntax (C#)
```csharp
public enum SolidGeometry
```